AccumulationRegisters/ПоказателиКадровогоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПоказателиКадровогоПлана</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимаяВакансия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПозицииКадровогоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиКадровогоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПозицииШтатногоРасписанияПоКадровомуПлану.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПозицииШтатногоРасписанияПоКадровомуПлану</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПозицияКадровогоПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПозицииКадровогоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПоказателейКадровыхПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателейКадровыхПланов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>16</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>16</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КадровыйПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КадровыйПлан</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПоказателя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиКадровогоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КатегорииРасходовНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КатегорииРасходовНаПерсонал</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Займы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСтавок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаннаяЗарплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаВОтпускеПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойНеЗависящийОтРаботодателяИРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеПоНевыясненнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускОсновной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпускНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйОплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеССохранениемОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеГосударственныхОбязанностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниНеОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынужденныйПрогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Болезнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоЗаконодательству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговорПриостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПоказателиКадровогоПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПоказателиКадровогоПланирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтраховыеВзносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВзносов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПозицииКадровогоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПозицииКадровогоПлана</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиКадровогоПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКадровогоПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КадровоеПланирование/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает информацию о последнем закрытом периоде начисления зарплаты.
//
// Возвращаемое значение:
//  - ПоследнийЗакрытыйПериод - Дата - дата последнего закрытого периода.
//
Функция ПоследнийПериодВыплатОтраженияЗарплаты() Экспорт
	
	ПоследнийЗакрытыйПериод = ВзаиморасчетыССотрудникамиРасширенный.ПоследнийПериодВзаиморасчетовССотрудниками();
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная.ОтражениеРасчетовЗарплатыВБухучете") Тогда
		Возврат ПоследнийЗакрытыйПериод;
	КонецЕсли;
	
	Возврат Макс(ПоследнийЗакрытыйПериод, ОбщегоНазначения.ОбщийМодуль("ОтражениеРасчетовЗарплатыВБухучете").ПоследнийПериодОтраженияЗарплаты());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение константы "ИспользоватьКадровоеПланирование".
//
// Возвращаемое значение:
//  Булево - значение константы.
//
Функция ИспользоватьКадровоеПланирование() Экспорт
	Возврат Константы.ИспользоватьКадровоеПланирование.Получить();
КонецФункции

// Обновляет значение константы "ИспользоватьКадровоеПланирование".
//
// Параметры:
//  Значение - Булево - значение константы.
//
Процедура ОбновитьИспользованиеКадровогоПланирования(Знач Значение) Экспорт
	Константы.ИспользоватьКадровоеПланирование.Установить(Значение);
КонецПроцедуры

// Возвращает элемент справочника "ПоказателиКадровогоПланирования" с категорией КоличествоСтавок
//
// Возвращаемое значение:
//  СправочникСсылка.ПоказателиКадровогоПланирования
//
Функция ПоказательКоличествоСтавок() Экспорт
	
	Возврат Справочники.ПоказателиКадровогоПланирования.НайтиПоРеквизиту("Категория",
		Перечисления.КатегорииРасходовНаПерсонал.КоличествоСтавок);
	
КонецФункции

// См. Перечисления.ВидыОперацийПоЗарплате.Взносы.
Функция ВидыОперацийПоЗарплатеВзносы() Экспорт
	Возврат Перечисления.ВидыОперацийПоЗарплате.Взносы();
КонецФункции

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(
		Наборы, "7488d015-ce7e-11eb-831d-9db1eefef239", Метаданные.Справочники.ПозицииКадровогоПлана);
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(
		Наборы, "7488d016-ce7e-11eb-831d-9db1eefef239", Метаданные.Справочники.ПоказателиКадровогоПланирования);
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(
		Наборы, "7488d017-ce7e-11eb-831d-9db1eefef239", Метаданные.Документы.КадровыйПлан);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.КадровыйПлан, Истина);
	Списки.Вставить(Метаданные.Справочники.КадровыйПланПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПозицииКадровогоПлана, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПоказателиКадровогоПлана, Истина);
	
КонецПроцедуры

// Заполняет описателей профилей групп доступа, предназначенных для работы с кадровым планом
// см. УправлениеДоступомПереопределяемый.ЗаполнитьПоставляемыеПрофилиГруппДоступа.
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт 
	
	ЕстьИнтерфейс = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыКомандныйИнтерфейс");
	
	ОписаниеПрофиля = ОписаниеПрофиляСпециалистПоПланированию(ЕстьИнтерфейс);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = ОписаниеПрофиляСтаршийСпециалистПоПланированию(ЕстьИнтерфейс);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.22.9",
		"Роль.НастройкаКадровогоПланирования",
		"Роль.ДобавлениеИзменениеСценариевПланирования");
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ПоказателиКадровогоПланирования.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.19.72";
	Обработчик.Процедура = "Справочники.ПоказателиКадровогоПланирования.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9a9acf99-c9d5-11eb-8317-9f9f9db68336");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение показателей кадрового планирования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.9";
	Обработчик.Процедура = "КадровоеПланирование.ДобавитьРолиДобавлениеИзменениеПоказателейКадровогоПланирования";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.71";
	Обработчик.Процедура = "КадровоеПланирование.ДобавитьРолиЧтениеСценариевПланирования";
	Обработчик.РежимВыполнения = "Оперативно";
	
КонецПроцедуры

Процедура ДобавитьРолиДобавлениеИзменениеПоказателейКадровогоПланирования() Экспорт
	
	ЗаменяемыеРоли = Новый Соответствие;
	
	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить(Метаданные.Роли.ДобавлениеИзменениеСценариевПланирования.Имя);
	НовыеРоли.Добавить(Метаданные.Роли.ДобавлениеИзменениеПоказателейКадровогоПланирования.Имя);
	ЗаменяемыеРоли.Вставить("ДобавлениеИзменениеСценариевПланирования", НовыеРоли);
	
	УправлениеДоступом.ЗаменитьРолиВПрофилях(ЗаменяемыеРоли);
	
КонецПроцедуры

Процедура ДобавитьРолиЧтениеСценариевПланирования() Экспорт
	
	ЗаменяемыеРоли = Новый Соответствие;
	
	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить(Метаданные.Роли.ЧтениеКадровогоПлана.Имя);
	НовыеРоли.Добавить(Метаданные.Роли.ЧтениеСценариевПланирования.Имя);
	ЗаменяемыеРоли.Вставить("ЧтениеКадровогоПлана", НовыеРоли);
	
	УправлениеДоступом.ЗаменитьРолиВПрофилях(ЗаменяемыеРоли);
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СостояниеКадровогоПлана);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СравнительныйАнализКадровогоПлана);
	
КонецПроцедуры

Функция ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапросаКомпоновки, ТолькоРазрешенные) Экспорт
	
	Запрос = Неопределено;
	Если ВРег(ИмяПредставления) = ВРег("ПоказателиКадровогоПлана") Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьКадровоеПланирование") Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ПоказательКоличествоСтавок", ПоказательКоличествоСтавок());
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПоказателиКадровогоПлана.Период КАК Период,
				|	ПоказателиКадровогоПлана.Сценарий КАК Сценарий,
				|	ПоказателиКадровогоПлана.Подразделение КАК Подразделение,
				|	ПоказателиКадровогоПлана.Позиция КАК Позиция,
				|	ПоказателиКадровогоПлана.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ПоказателиКадровогоПлана.Сотрудник КАК Сотрудник,
				|	ПоказателиКадровогоПлана.Показатель КАК Показатель,
				|	ПоказателиКадровогоПлана.ЗависимаяВакансия КАК ЗависимаяВакансия,
				|	СУММА(ПоказателиКадровогоПлана.Значение) КАК Значение
				|ПОМЕСТИТЬ ВТПредварительноПоказателиКадровогоПлана
				|ИЗ
				|	РегистрНакопления.ПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
				|ГДЕ
				|	ПоказателиКадровогоПлана.Период МЕЖДУ &НачалоПериода И &КонецПериода
				|{ГДЕ
				|	(ПоказателиКадровогоПлана.Сценарий = &Сценарий),
				|	(ПоказателиКадровогоПлана.Подразделение В ИЕРАРХИИ (&Подразделение))}
				|
				|СГРУППИРОВАТЬ ПО
				|	ПоказателиКадровогоПлана.Период,
				|	ПоказателиКадровогоПлана.Сценарий,
				|	ПоказателиКадровогоПлана.Подразделение,
				|	ПоказателиКадровогоПлана.Позиция,
				|	ПоказателиКадровогоПлана.ФизическоеЛицо,
				|	ПоказателиКадровогоПлана.Сотрудник,
				|	ПоказателиКадровогоПлана.Показатель,
				|	ПоказателиКадровогоПлана.ЗависимаяВакансия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПоказателиКадровогоПлана.Сценарий КАК Сценарий,
				|	ПоказателиКадровогоПлана.Подразделение КАК Подразделение,
				|	ПоказателиКадровогоПлана.Позиция КАК Позиция,
				|	ПоказателиКадровогоПлана.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ПоказателиКадровогоПлана.Сотрудник КАК Сотрудник,
				|	ПоказателиКадровогоПлана.Показатель КАК Показатель,
				|	ПоказателиКадровогоПлана.ЗависимаяВакансия КАК ЗависимаяВакансия
				|ПОМЕСТИТЬ ВТЗаполненныеПоказатели
				|ИЗ
				|	ВТПредварительноПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
				|ГДЕ
				|	ПоказателиКадровогоПлана.Показатель = &ПоказательКоличествоСтавок
				|
				|СГРУППИРОВАТЬ ПО
				|	ПоказателиКадровогоПлана.Сценарий,
				|	ПоказателиКадровогоПлана.Подразделение,
				|	ПоказателиКадровогоПлана.Позиция,
				|	ПоказателиКадровогоПлана.ФизическоеЛицо,
				|	ПоказателиКадровогоПлана.Сотрудник,
				|	ПоказателиКадровогоПлана.Показатель,
				|	ПоказателиКадровогоПлана.ЗависимаяВакансия
				|
				|ИМЕЮЩИЕ
				|	СУММА(ПоказателиКадровогоПлана.Значение) > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПоказателиКадровогоПлана.Период КАК Период,
				|	ПоказателиКадровогоПлана.Сценарий КАК Сценарий,
				|	ПоказателиКадровогоПлана.Подразделение КАК Подразделение,
				|	ПоказателиКадровогоПлана.Позиция КАК Позиция,
				|	ПоказателиКадровогоПлана.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ПоказателиКадровогоПлана.Сотрудник КАК Сотрудник,
				|	ПоказателиКадровогоПлана.Показатель КАК Показатель,
				|	ПоказателиКадровогоПлана.ЗависимаяВакансия КАК ЗависимаяВакансия,
				|	ПоказателиКадровогоПлана.Значение КАК Значение,
				|	0 КАК ФОТ,
				|	0 КАК ФОТМин,
				|	0 КАК ФОТМакс,
				|	0 КАК ФОТПозиции,
				|	0 КАК ФОТПозицииМин,
				|	0 КАК ФОТПозицииМакс,
				|	0 КАК ОкладТариф,
				|	0 КАК ОкладТарифМин,
				|	0 КАК ОкладТарифМакс,
				|	ЛОЖЬ КАК Занята
				|ПОМЕСТИТЬ Представления_ПоказателиКадровогоПлана
				|ИЗ
				|	ВТПредварительноПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
				|ГДЕ
				|	(ПоказателиКадровогоПлана.Сценарий, ПоказателиКадровогоПлана.Подразделение, ПоказателиКадровогоПлана.Позиция, ПоказателиКадровогоПлана.ФизическоеЛицо, ПоказателиКадровогоПлана.Сотрудник, ПоказателиКадровогоПлана.ЗависимаяВакансия) В
				|			(ВЫБРАТЬ
				|				Т.Сценарий,
				|				Т.Подразделение,
				|				Т.Позиция,
				|				Т.ФизическоеЛицо,
				|				Т.Сотрудник,
				|				Т.ЗависимаяВакансия
				|			ИЗ
				|				ВТЗаполненныеПоказатели КАК Т)";
				
			Если ПараметрыЗапросаКомпоновки.Свойство("СценарийОбязателен") Тогда
				Если ВРег(ПараметрыЗапросаКомпоновки["СценарийОбязателен"]) = "ИСТИНА" Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ГДЕ", "");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ПоказателиКадровогоПлана.Сценарий = &Сценарий),", "И ПоказателиКадровогоПлана.Сценарий = &Сценарий");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ПоказателиКадровогоПлана.Подразделение", "{ГДЕ (ПоказателиКадровогоПлана.Подразделение");
				КонецЕсли;
			КонецЕсли; 
			
			ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область НастройкаПодсистемыПечать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - из менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.КадровыйПлан);
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт

	Раздел = Разделы.Добавить();
	Раздел.Имя = "КадровоеПланирование";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("42a6fefb-f11d-11eb-8349-ef0fa348ed20");
	Раздел.Представление = НСтр("ru = 'Кадровое планирование'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));

КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КадровыйПлан", "Дата", "КадровоеПланирование", "Подразделение.Источник");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДвиженияПоПоказателямКадровогоПлана

Процедура СформироватьДвиженияПоПоказателямКадровогоПлана(Движения, ДанныеДляПроведения) Экспорт
	
	Если Не ДанныеДляПроведения.Свойство("ПоказателиКадровогоПлана")
		Или Не ЗначениеЗаполнено(ДанныеДляПроведения.ПоказателиКадровогоПлана) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДанныхДляПроведения Из ДанныеДляПроведения.ПоказателиКадровогоПлана Цикл
		СтрокаДвижений = Движения.ПоказателиКадровогоПлана.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДанныхДляПроведения);
	КонецЦикла;
	
	Если Движения.ПоказателиКадровогоПлана.Количество() > 0 Тогда
		Движения.ПоказателиКадровогоПлана.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШтатноеРасписание

Функция ДлительнаяОперацияЗаполненияПоКадровомуПлану(Форма, Сценарий, УчитыватьМесяц = Ложь) Экспорт
	
	Объект = Форма.Объект;
	ПараметрыМетода = Новый Структура("Организация,Подразделение,ДатаВступленияВСилу");
	ЗаполнитьЗначенияСвойств(ПараметрыМетода, Объект);
	
	Если УчитыватьМесяц Тогда
		ПараметрыМетода.ДатаВступленияВСилу = Объект.МесяцВступленияВСилу;
	КонецЕсли;
	ПараметрыМетода.Вставить("Позиции", Объект.Позиции.Выгрузить());
	ПараметрыМетода.Вставить("Начисления", Объект.Начисления.Выгрузить());
	ПараметрыМетода.Вставить("Показатели", Объект.Показатели.Выгрузить());
	ПараметрыМетода.Вставить("Сценарий", Сценарий);
	ПараметрыМетода.Вставить("ЕжегодныеОтпуска", Объект.ЕжегодныеОтпуска.Выгрузить());
	ПараметрыМетода.Вставить("Специальности", Объект.Специальности.Выгрузить());
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Форма.УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"УправлениеШтатнымРасписанием.РезультатЗаполненияПоТекущейКадровойРасстановке", ПараметрыМетода);
	
КонецФункции

Функция ЗапросПоОтклонениюШтатногоРасписания(ПараметрыВыполнения, ТекущиеПозиции, СтандартнаяОбработка) Экспорт
	
	Если Не ПараметрыВыполнения.Свойство("Сценарий") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	Дата = ПараметрыВыполнения.ДатаВступленияВСилу;
	Организация = ПараметрыВыполнения.Организация;
	Подразделение = ПараметрыВыполнения.Подразделение;	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущиеПозиции", ТекущиеПозиции);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Сценарий", ПараметрыВыполнения.Сценарий);
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(Дата, Организация, Подразделение);	
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения, "Подразделение,МестоВСтруктуреПредприятия,Должность,КоличествоСтавок");
	
	Запрос.Текст = ТекстЗапросаПоОтклонениюШтатногоРасписанияОтКадровогоПлана();
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	|	МАКСИМУМ(ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияКадровогоПлана) КАК ПозицияКадровогоПлана
	|ПОМЕСТИТЬ ВТПозицииШтатногоРасписанияПоКадровомуПлану
	|ИЗ
	|	РегистрСведений.ПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииШтатногоРасписанияПоКадровомуПлану
	|
	|СГРУППИРОВАТЬ ПО
	|	ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПозицияШтатногоРасписания,
	|	ПозицияКадровогоПлана
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеПозиции.Должность КАК Должность,
	|	ТекущиеПозиции.Подразделение КАК Подразделение,
	|	ТекущиеПозиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ТекущиеПозиции.КоличествоСтавок КАК КоличествоСтавок,
	|	ТекущиеПозиции.Позиция КАК Позиция,
	|	ТекущиеПозиции.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана,
	|	ТекущиеПозиции.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТТекущиеПозицииПредварительно
	|ИЗ
	|	&ТекущиеПозиции КАК ТекущиеПозиции
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеПозиции.Должность КАК Должность,
	|	ТекущиеПозиции.Подразделение КАК Подразделение,
	|	ТекущиеПозиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ТекущиеПозиции.КоличествоСтавок КАК КоличествоСтавок,
	|	ТекущиеПозиции.Позиция КАК Позиция,
	|	ВЫБОР
	|		КОГДА ТекущиеПозиции.ПозицияКадровогоПлана = ЗНАЧЕНИЕ(Справочник.ПозицииКадровогоПлана.ПустаяСсылка)
	|			ТОГДА ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияКадровогоПлана
	|		ИНАЧЕ ТекущиеПозиции.ПозицияКадровогоПлана
	|	КОНЕЦ КАК ПозицияКадровогоПлана,
	|	ТекущиеПозиции.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТТекущиеПозиции
	|ИЗ
	|	ВТТекущиеПозицииПредварительно КАК ТекущиеПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииШтатногоРасписанияПоКадровомуПлану
	|		ПО ТекущиеПозиции.Позиция = ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ИзмененияШтатногоРасписания.Должность, ТекущиеПозиции.Должность) КАК Должность,
	|	ЕСТЬNULL(ИзмененияШтатногоРасписания.Подразделение, ТекущиеПозиции.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ИзмененияШтатногоРасписания.МестоВСтруктуреПредприятия, ТекущиеПозиции.МестоВСтруктуреПредприятия) КАК МестоВСтруктуреПредприятия,
	|	ЕСТЬNULL(ИзмененияШтатногоРасписания.КоличествоСтавок, ТекущиеПозиции.КоличествоСтавок) КАК КоличествоСтавок,
	|	ЕСТЬNULL(ИзмененияШтатногоРасписания.ПозицияШтатногоРасписания, ТекущиеПозиции.Позиция) КАК Позиция,
	|	ЕСТЬNULL(ИзмененияШтатногоРасписания.ПозицияКадровогоПлана, ТекущиеПозиции.ПозицияКадровогоПлана) КАК ПозицияКадровогоПлана,
	|	ВЫБОР
	|		КОГДА ТекущиеПозиции.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НоваяСтрока,
	|	ЕСТЬNULL(ТекущиеПозиции.НомерСтроки, 9999999) КАК НомерСтрокиПорядок
	|ПОМЕСТИТЬ ВТИзмененияШтатногоРасписания
	|ИЗ
	|	ВТПозицииСИзменениями КАК ИзмененияШтатногоРасписания
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТекущиеПозиции КАК ТекущиеПозиции
	|		ПО ИзмененияШтатногоРасписания.Подразделение = ТекущиеПозиции.Подразделение
	|			И ИзмененияШтатногоРасписания.Должность = ТекущиеПозиции.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмененияШтатногоРасписания.Должность КАК Должность,
	|	ИзмененияШтатногоРасписания.Подразделение КАК Подразделение,
	|	ИзмененияШтатногоРасписания.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ИзмененияШтатногоРасписания.КоличествоСтавок КАК КоличествоСтавок,
	|	ИзмененияШтатногоРасписания.Позиция КАК Позиция,
	|	ИзмененияШтатногоРасписания.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана,
	|	ИзмененияШтатногоРасписания.НоваяСтрока КАК НоваяСтрока,
	|	ИзмененияШтатногоРасписания.НомерСтрокиПорядок КАК НомерСтрокиПорядок,
	|	ИзмененияШтатногоРасписания.Должность.ТарифнаяСетка КАК ТарифнаяСетка,
	|	ИзмененияШтатногоРасписания.Должность.ТарифнаяСеткаНадбавки КАК ТарифнаяСеткаНадбавки,
	|	ИзмененияШтатногоРасписания.Должность.РазрядКатегория КАК РазрядКатегория,
	|	ИзмененияШтатногоРасписания.Должность.РазрядКатегорияНадбавки КАК РазрядКатегорияНадбавки,
	|	ИзмененияШтатногоРасписания.Должность.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией КАК
	|		ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ИзмененияШтатногоРасписания.Должность.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
	|	ИзмененияШтатногоРасписания.Должность.ОсобыеУсловияТрудаПФР КАК ОсобыеУсловияТрудаПФР,
	|	ИзмененияШтатногоРасписания.Должность.ПроцентНадбавкиЗаВредность КАК ПроцентНадбавкиЗаВредность,
	|	ИзмененияШтатногоРасписания.Должность.ВыплачиваетсяНадбавкаЗаВредность КАК ВыплачиваетсяНадбавкаЗаВредность,
	|	ИзмененияШтатногоРасписания.Должность.КоличествоДнейДополнительногоОтпускаВГод КАК
	|		КоличествоДнейДополнительногоОтпускаВГод,
	|	ИзмененияШтатногоРасписания.Должность.КодПозицииСпискаПФР КАК КодПозицииСпискаПФР,
	|	ИзмененияШтатногоРасписания.Должность.ХарактерВыполняемыхРаботПФР КАК ХарактерВыполняемыхРаботПФР,
	|	ИзмененияШтатногоРасписания.Должность.ПервичныеДокументыПФР КАК ПервичныеДокументыПФР,
	|	ИзмененияШтатногоРасписания.Должность.ТрудоваяФункция КАК ТрудоваяФункция
	|ИЗ
	|	ВТИзмененияШтатногоРасписания КАК ИзмененияШтатногоРасписания
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТекущиеПозиции КАК ТекущиеПозиции
	|		ПО ИзмененияШтатногоРасписания.Подразделение = ТекущиеПозиции.Подразделение
	|			И ИзмененияШтатногоРасписания.Должность = ТекущиеПозиции.Должность
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиПорядок";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ЗаполнитьПозициюКадровогоПлана(СтрокаПриемник, СтрокаИсточник, СтандартнаяОбработка) Экспорт
	
	Если СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, "ПозицияКадровогоПлана");
	
КонецПроцедуры

#КонецОбласти

Процедура ПередЗаписьюДокументовИзмененияШтатногоРасписания(Объект) Экспорт
	
	Если Не ИспользоватьКадровоеПланирование() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПозицииШтатногоРасписанияПоКадровомуПлану) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПозиции Из Объект.Позиции Цикл
		Если Не ЗначениеЗаполнено(СтрокаПозиции.ПозицияКадровогоПлана) Тогда
			Продолжить;
		КонецЕсли;
		УстановитьСвязьПозиций(СтрокаПозиции.Позиция, СтрокаПозиции.ПозицияКадровогоПлана);
	КонецЦикла;
	
КонецПроцедуры

// Создает временную таблицу плановых начислений сотрудников.
// При необходимости следует дополнить ВТПлановыеНачисленияСотрудников конструкцией ОБЪЕДИНИТЬ ВСЕ 
//
// Параметры:
//		МенеджерВременныхТаблиц 	- МенеджерВременныхТаблиц
//  	ИмяВТСотрудники 			- Строка - Имя ВТ, содержащей периоды работы сотрудников. см. процедуру СоздатьВТПериодыРаботыСотрудников. 
//
Процедура СоздатьВТПлановыеНачисленияСотрудников(МенеджерВременныхТаблиц, ИмяВТСотрудники = "ВТПериодыРаботыСотрудников") Экспорт
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяВТСотрудники, "Сотрудник");
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПостроения.ОтборыПрименяемыеКСрезу, "Используется", "=", Истина);
	
	ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраСрезПоследних(
		"ПлановыйФОТ", МенеджерВременныхТаблиц, Истина, ОписаниеФильтра, ПараметрыПостроения);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлановыйФОТСрезПоследних.Период КАК Период,
		|	ПлановыйФОТСрезПоследних.Сотрудник КАК Сотрудник,
		|	ПлановыйФОТСрезПоследних.Начисление КАК Начисление,
		|	ПлановыйФОТСрезПоследних.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПлановыйФОТСрезПоследних.ВкладВФОТ КАК Сумма
		|ПОМЕСТИТЬ ВТПлановыеНачисленияСотрудников
		|ИЗ
		|	ВТПлановыйФОТСрезПоследних КАК ПлановыйФОТСрезПоследних";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Дополняет временную таблицу плановых начислений позиций штатного расписания.
// При необходимости следует дополнить ВТВременнаяТаблица конструкцией ОБЪЕДИНИТЬ ВСЕ 
//
// Параметры:
//		МенеджерВременныхТаблиц 	- МенеджерВременныхТаблиц
//									содержит обязательные таблицы:
//										"ВТНачисленияПозицийШтатногоРасписания" см. процедуру УправлениеШтатнымРасписанием.СоздатьВТНачисленияШтатногоРасписания
//  	ИмяВТСотрудники 			- Строка - Имя ВТ, содержащей периоды работы сотрудников. см. процедуру СоздатьВТПериодыРаботыСотрудников. 
//
Процедура ДополнитьТаблицуПлановыхНачисленийШтатногоРасписания(МенеджерВременныхТаблиц, ИмяВТСотрудники = "ВТПериодыРаботыСотрудников") Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияШтатногоРасписания.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	НачисленияШтатногоРасписания.Начисление КАК Начисление,
		|	НачисленияШтатногоРасписания.Размер КАК Размер
		|ПОМЕСТИТЬ ВТВременнаяТаблица
		|ИЗ
		|	ВТНачисленияПозицийШтатногоРасписания КАК НачисленияШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНачисленияПозицийШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ВременнаяТаблица.Начисление КАК Начисление,
		|	ВременнаяТаблица.Размер КАК Размер
		|ПОМЕСТИТЬ ВТНачисленияПозицийШтатногоРасписания
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВременнаяТаблица";
	
	Запрос.Выполнить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПрофиляСпециалистПоПланированию(ПраваНаИнтерфейс = Ложь)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСпециалистПоПланированию();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Специалист по планированию'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеКадровогоПлана");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "НастройкаСвязейПозицийШтатногоРасписанияПоКадровомуПлану");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСценариевПланирования");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеАналитикаФинансовогоУчета", "ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеФинансовогоУчетаПозицийКадровогоПлана", "ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПросмотрРедактированияИсторииСРаспределениемФинансовыйУчет", "ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет");
	
	// Штатное расписание
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеШтатногоРасписания");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНачисленийШтатногоРасписания");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеАрхиваФизическихЛиц", "ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеИспытательногоСрокаСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудниковРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРабочегоВремени");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСостоянийСотрудников");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраНачисленияУдержанияПоказатели");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраПлановыхНачислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраРегистраРасчетаНачисления");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхОбОбразованииФизическихЛиц");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПрофилейДолжности", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЛичныхДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеХарактеристикПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДействийСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		МодульКонфигурацииЗарплатаКадрыРасширенный = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		МодульКонфигурацииЗарплатаКадрыРасширенный.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		МодульПоискФизическихЛиц.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Если ПраваНаИнтерфейс Тогда
		ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаКадровоеПланирование");
		ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПанельОтчетовПодборПерсонала");
	КонецЕсли;
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляСпециалистПоПланированию()
	
	Возврат "caedf442-f75f-11eb-8351-f27f7feaf994";
	
КонецФункции

Функция ОписаниеПрофиляСтаршийСпециалистПоПланированию(ПраваНаИнтерфейс = Ложь)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСтаршийСпециалистПоПланированию();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Старший специалист по планированию'");
	
	ЗарплатаКадрыРасширенный.ДополнитьПрофиль(ОписаниеПрофиля, ОписаниеПрофиляСпециалистПоПланированию(ПраваНаИнтерфейс));
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПоказателейКадровогоПланирования");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСценариевПланирования");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПросмотрПодбораВидовРасчета");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПВРНачисления");

	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляСтаршийСпециалистПоПланированию() 
	
	Возврат "caedf443-f75f-11eb-8351-f27f7feaf994";
	
КонецФункции

Функция ТекстЗапросаПоОтклонениюШтатногоРасписанияОтКадровогоПлана()
	
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоказателиКадровогоПланаОбороты.Позиция КАК Позиция,
	|	ПоказателиКадровогоПланаОбороты.Подразделение КАК МестоВСтруктуреПредприятия,
	|	ПоказателиКадровогоПланаОбороты.Позиция.Должность КАК Должность,
	|	СУММА(ПоказателиКадровогоПланаОбороты.Значение) КАК КоличествоСтавок
	|ПОМЕСТИТЬ ВТПоказателиКадровогоПлана
	|ИЗ
	|	РегистрНакопления.ПоказателиКадровогоПлана КАК ПоказателиКадровогоПланаОбороты
	|ГДЕ
	|	ПоказателиКадровогоПланаОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоказателиКадровогоПланаОбороты.Сценарий = &Сценарий
	|	И ПоказателиКадровогоПланаОбороты.Показатель.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииРасходовНаПерсонал.КоличествоСтавок)
	|	И ПоказателиКадровогоПланаОбороты.Подразделение В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.МестоВСтруктуреПредприятия
	|			ИЗ
	|				ВТШтатноеРасписание КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиКадровогоПланаОбороты.Позиция,
	|	ПоказателиКадровогоПланаОбороты.Подразделение,
	|	ПоказателиКадровогоПланаОбороты.Позиция.Должность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиКадровогоПлана.Позиция,
	|	ПоказателиКадровогоПлана.Подразделение,
	|	ПоказателиКадровогоПлана.Позиция.Должность,
	|	0
	|ИЗ
	|	РегистрНакопления.ПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
	|ГДЕ
	|	ПоказателиКадровогоПлана.Сценарий = &Сценарий
	|	И ПоказателиКадровогоПлана.Показатель.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииРасходовНаПерсонал.КоличествоСтавок)
	|	И ПоказателиКадровогоПлана.Значение = 0
	|	И ПоказателиКадровогоПлана.Подразделение В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.МестоВСтруктуреПредприятия
	|			ИЗ
	|				ВТШтатноеРасписание КАК Т)
	|	И ПоказателиКадровогоПлана.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиКадровогоПлана.Позиция,
	|	ПоказателиКадровогоПлана.Подразделение,
	|	ПоказателиКадровогоПлана.Позиция.Должность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоказателиКадровогоПлана.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ВЫБОР
	|		КОГДА СтруктураПредприятия.Источник ЕСТЬ NULL
	|				ИЛИ СтруктураПредприятия.Источник = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания ЕСТЬ NULL
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|					ИНАЧЕ ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания.Подразделение
	|				КОНЕЦ
	|		ИНАЧЕ СтруктураПредприятия.Источник
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания ЕСТЬ NULL
	|			ТОГДА ПоказателиКадровогоПлана.Должность
	|		ИНАЧЕ ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания.Должность
	|	КОНЕЦ КАК Должность,
	|	ПоказателиКадровогоПлана.Позиция КАК ПозицияКадровогоПлана,
	|	ЕСТЬNULL(ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания, ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)) КАК ПозицияШтатногоРасписания,
	|	ПоказателиКадровогоПлана.КоличествоСтавок КАК КоличествоСтавок
	|ПОМЕСТИТЬ ВТПозицииКадровогоПлана
	|ИЗ
	|	ВТПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииШтатногоРасписанияПоКадровомуПлану
	|		ПО ПоказателиКадровогоПлана.Позиция = ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияКадровогоПлана
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО ПоказателиКадровогоПлана.МестоВСтруктуреПредприятия = СтруктураПредприятия.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПозицииКадровогоПлана.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана,
	|	ПозицииКадровогоПлана.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ПозицииКадровогоПлана.Подразделение КАК Подразделение,
	|	ПозицииКадровогоПлана.Должность КАК Должность,
	|	ЕСТЬNULL(ПозицииШтатногоРасписания.ПозицияШтатногоРасписания, ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)) КАК ПозицияШтатногоРасписания,
	|	СУММА(ПозицииКадровогоПлана.КоличествоСтавок) КАК КоличествоСтавок
	|ПОМЕСТИТЬ ВТПозицииСИзменениями
	|ИЗ
	|	ВТПозицииКадровогоПлана КАК ПозицииКадровогоПлана
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтатноеРасписание КАК ПозицииШтатногоРасписания
	|		ПО (ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = ПозицииКадровогоПлана.ПозицияШтатногоРасписания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПозицииКадровогоПлана.ПозицияКадровогоПлана,
	|	ПозицииКадровогоПлана.МестоВСтруктуреПредприятия,
	|	ПозицииКадровогоПлана.Подразделение,
	|	ПозицииКадровогоПлана.Должность,
	|	ЕСТЬNULL(ПозицииШтатногоРасписания.ПозицияШтатногоРасписания, ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка))
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ПозицииШтатногоРасписания.КоличествоСтавок, 0)) <> СУММА(ПозицииКадровогоПлана.КоличествоСтавок)";
	
	Возврат Текст;
	
КонецФункции

Процедура ЗаполнитьИнформационнуюСтрокуЗанятости(СтрокаТаблицы) Экспорт
	
	ВакантноСтавок = СтрокаТаблицы.КоличествоСтавок - СтрокаТаблицы.ЗанятоСтавок;
	
	ЧастиНадписи = Новый Массив;
	
	ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(Строка(СтрокаТаблицы.Сценарий), ШрифтыСтиля.ВажнаяНадписьШрифт));
	ЧастиНадписи.Добавить(": ");
	
	ТекстВакантноСтавок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';Вакантна %1 ставка;;Вакантно %1 ставки;Вакантно %1 ставок;Вакантно %1 ставки'"), 
		ВакантноСтавок);
	ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстВакантноСтавок, ШрифтыСтиля.ВажнаяНадписьШрифт));
	
	ТекстКоличествоСтавок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';запланирована %1 ставка;;запланировано %1 ставки;запланировано %1 ставок;запланировано %1 ставки'"), 
		СтрокаТаблицы.КоличествоСтавок);
	ЧастиНадписи.Добавить(" (");
	ЧастиНадписи.Добавить(ТекстКоличествоСтавок);
	
	ТекстЗанятоСтавок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';занята %1 ставка;;занято %1 ставки;занято %1 ставок;занято %1 ставки'"), 
		СтрокаТаблицы.ЗанятоСтавок);
	ЧастиНадписи.Добавить(", ");
	ЧастиНадписи.Добавить(ТекстЗанятоСтавок);
	
	Сотрудников = СтрокаТаблицы.ЗанятоСотрудниками.Количество();
	Если Сотрудников > 0 Тогда
		ЧастиНадписи.Добавить(" ");
		ЧастиНадписи.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';сотрудником;;сотрудниками;сотрудниками;сотрудниками'"), 
			Сотрудников));
		ЧастиНадписи.Добавить(" ");
		СотрудниковВключено = 0;
		Для Каждого Сотрудник Из СтрокаТаблицы.ЗанятоСотрудниками Цикл
			Если СотрудниковВключено = 3 Тогда
				Прервать;
			КонецЕсли;
			ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Сотрудник));
			Если СотрудниковВключено > 0 Тогда
				ЧастиНадписи.Добавить(", ");
			КонецЕсли;
			ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ФамилияИнициалы, , , , ПолучитьНавигационнуюСсылку(Сотрудник)));
			СотрудниковВключено = СотрудниковВключено + 1;
		КонецЦикла;
		ЕщеОсталось = Сотрудников - СотрудниковВключено;
		Если ЕщеОсталось > 0 Тогда
			ЧастиНадписи.Добавить(" ");
			ЧастиНадписи.Добавить(НСтр("ru = 'и'"));
			ЧастиНадписи.Добавить(" ");
			ТекстЕщеСотрудники = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'еще %1'"), 
				ЕщеОсталось);
			ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстЕщеСотрудники, , , , "СотрудникиПозиции"));
		КонецЕсли;
	КонецЕсли;
	
	ЧастиНадписи.Добавить(")");
	
	СтрокаТаблицы.ИнформационнаяСтрокаЗанятости = Новый ФорматированнаяСтрока(ЧастиНадписи);
	
КонецПроцедуры

Функция МесяцСтрокой(НомерМесяца, СЗаглавнойБуквы = Ложь) Экспорт
	
	МесяцСтрокой = НРег(Формат(Дата(10, НомерМесяца, 1), НСтр("ru='ДФ=''ММММ'''")));
	
	Если СЗаглавнойБуквы Тогда 
		МесяцСтрокой = ВРег(Сред(МесяцСтрокой, 1, 1)) + Сред(МесяцСтрокой, 2);
	КонецЕсли;
	
	Возврат МесяцСтрокой;
	
КонецФункции

Процедура СоздатьВТПериодыРаботыСотрудников(МенеджерВременныхТаблиц, ИмяВТПозиции, ДатаНачала, ДатаОкончания) Экспорт

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПозиции.Позиция КАК Позиция
		|ИЗ
		|	#ВТПозиции КАК ВТПозиции";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПозиции", ИмяВТПозиции);
	
	РезультатПозиций = Запрос.Выполнить();
	МассивПозиций = РезультатПозиций.Выгрузить().ВыгрузитьКолонку("Позиция");
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.НачалоПериода = ДатаНачала;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = ДатаОкончания;
	ПараметрыПолученияСотрудников.КадровыеДанные = "ДолжностьПоШтатномуРасписанию,Состояние";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПолученияСотрудников.Отборы, "ДолжностьПоШтатномуРасписанию", "В", МассивПозиций);
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	УдалитьВТ.Добавить("ВТСотрудникиОрганизации");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТФильтрДляПериодовРаботыСотрудников
		|ИЗ
		|	ВТСотрудникиОрганизации КАК КадровыеДанныеСотрудников
		|ГДЕ
		|	КадровыеДанныеСотрудников.Состояние В (&Состояния)";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.СостоянияСотрудника.Работа);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.РаботаВОтпускеПоУходуЗаРебенком);
	Запрос.УстановитьПараметр("Состояния", Состояния);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТФильтрДляПериодовРаботыСотрудников");
	
	ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрДляПериодовРаботыСотрудников", "Сотрудник"),
		ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра(),
		"ВТРабочиеМестаСотрудников");
		
	УдалитьВТ.Добавить("ВТРабочиеМестаСотрудников");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, ДатаНачала, ДатаОкончания);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ЕСТЬNULL(ПозицииПоКадровомуПлану.ПозицияКадровогоПлана, НЕОПРЕДЕЛЕНО)) КАК ПозицияКадровогоПлана,
		|	Позиции.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТШтатноеРасписаниеСКадровымПланом
		|ИЗ
		|	#ВТПозиции КАК Позиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииПоКадровомуПлану
		|		ПО Позиции.Позиция = ПозицииПоКадровомуПлану.ПозицияШтатногоРасписания
		|СГРУППИРОВАТЬ ПО
		|	Позиции.Позиция
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Периоды.Период КАК Период,
		|	ВТПозиции.Позиция КАК Позиция,
		|	ВТПозиции.Подразделение КАК Подразделение,
		|	ВЫРАЗИТЬ(ВТПозиции.Позиция КАК Справочник.ШтатноеРасписание).Владелец КАК Организация,
		|	ШтатноеРасписаниеСКадровымПланом.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана
		|ПОМЕСТИТЬ ВТПериодыПозиций
		|ИЗ
		|	ВТПериоды КАК Периоды,
		|	#ВТПозиции КАК ВТПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтатноеРасписаниеСКадровымПланом КАК ШтатноеРасписаниеСКадровымПланом
		|		ПО ВТПозиции.Позиция = ШтатноеРасписаниеСКадровымПланом.Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ПериодыРаботыСотрудников.НачалоПериода < ФильтрДляПериодовРаботыСотрудников.ДатаНачала
		|			ТОГДА ФильтрДляПериодовРаботыСотрудников.ДатаНачала
		|		ИНАЧЕ ПериодыРаботыСотрудников.НачалоПериода
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ПериодыРаботыСотрудников.КонецПериода > ФильтрДляПериодовРаботыСотрудников.ДатаОкончания
		|			ТОГДА ФильтрДляПериодовРаботыСотрудников.ДатаОкончания
		|		ИНАЧЕ ПериодыРаботыСотрудников.КонецПериода
		|	КОНЕЦ КАК ДатаОкончания,
		|	ПериодыРаботыСотрудников.ДолжностьПоШтатномуРасписанию КАК Позиция,
		|	ПериодыРаботыСотрудников.Подразделение КАК Подразделение,
		|	ПериодыРаботыСотрудников.Организация КАК Организация,
		|	ПериодыРаботыСотрудников.КоличествоСтавок КАК КоличествоСтавок
		|ПОМЕСТИТЬ ВТПериодыРаботыСотрудниковПредварительно
		|ИЗ
		|	ВТРабочиеМестаСотрудников КАК ПериодыРаботыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТПозиции КАК ВТПозиции
		|		ПО ПериодыРаботыСотрудников.ДолжностьПоШтатномуРасписанию = ВТПозиции.Позиция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФильтрДляПериодовРаботыСотрудников КАК ФильтрДляПериодовРаботыСотрудников
		|		ПО ПериодыРаботыСотрудников.Сотрудник = ФильтрДляПериодовРаботыСотрудников.Сотрудник
		|ГДЕ
		|	ПериодыРаботыСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПозиций.Период КАК Период,
		|	ПериодыПозиций.Позиция КАК Позиция,
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПозицииПустышки
		|ИЗ
		|	ВТПериодыПозиций КАК ПериодыПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыРаботыСотрудниковПредварительно КАК ПериодыРаботыСотрудников
		|		ПО ПериодыПозиций.Позиция = ПериодыРаботыСотрудников.Позиция
		|		И (ВЫБОР
		|			КОГДА ПериодыПозиций.Период < ПериодыРаботыСотрудников.ДатаНачала
		|				ТОГДА ИСТИНА
		|			КОГДА ПериодыПозиций.Период > ПериодыРаботыСотрудников.ДатаОкончания
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииПустышки.Позиция КАК Позиция,
		|	ПозицииПустышки.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПозицииПустышкиСгруппированные
		|ИЗ
		|	ВТПозицииПустышки КАК ПозицииПустышки
		|СГРУППИРОВАТЬ ПО
		|	ПозицииПустышки.Позиция,
		|	ПозицииПустышки.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПозиций.Период КАК Период,
		|	ПериодыПозиций.Позиция КАК Позиция,
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПозицииЗаполненные
		|ИЗ
		|	ВТПериодыПозиций КАК ПериодыПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыРаботыСотрудниковПредварительно КАК ПериодыРаботыСотрудников
		|		ПО ПериодыПозиций.Позиция = ПериодыРаботыСотрудников.Позиция
		|		И (ПериодыПозиций.Период >= НАЧАЛОПЕРИОДА(ПериодыРаботыСотрудников.ДатаНачала, МЕСЯЦ))
		|		И ПериодыПозиций.Период <= ПериодыРаботыСотрудников.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииЗаполненные.Позиция КАК Позиция,
		|	ПозицииЗаполненные.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПозицииЗаполненныеСгруппированные
		|ИЗ
		|	ВТПозицииЗаполненные КАК ПозицииЗаполненные
		|СГРУППИРОВАТЬ ПО
		|	ПозицииЗаполненные.Позиция,
		|	ПозицииЗаполненные.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииПустышки.Сотрудник КАК Сотрудник,
		|	ПериодыПозиций.Период КАК Период,
		|	ПериодыПозиций.Позиция КАК Позиция,
		|	ПериодыПозиций.Подразделение КАК Подразделение,
		|	ПериодыПозиций.Организация КАК Организация,
		|	ПериодыПозиций.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана
		|ПОМЕСТИТЬ ВТПериодыРаботыПустышки
		|ИЗ
		|	ВТПериодыПозиций КАК ПериодыПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПозицииПустышкиСгруппированные КАК ПозицииПустышки
		|		ПО ПериодыПозиций.Позиция = ПозицииПустышки.Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииЗаполненные.Сотрудник КАК Сотрудник,
		|	ПериодыПозиций.Период КАК Период,
		|	ПериодыПозиций.Позиция КАК Позиция,
		|	ПериодыПозиций.Подразделение КАК Подразделение,
		|	ПериодыПозиций.Организация КАК Организация,
		|	ПериодыПозиций.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана
		|ПОМЕСТИТЬ ВТПериодыРаботыЗаполненные
		|ИЗ
		|	ВТПериодыПозиций КАК ПериодыПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПозицииЗаполненныеСгруппированные КАК ПозицииЗаполненные
		|		ПО ПериодыПозиций.Позиция = ПозицииЗаполненные.Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ПериодыРаботыЗаполненные.Сотрудник, НЕОПРЕДЕЛЕНО) КАК Сотрудник,
		|	ПериодыПозиций.Период КАК Период,
		|	ЕСТЬNULL(ПериодыРаботыЗаполненные.Позиция, ПериодыПозиций.Позиция) КАК Позиция,
		|	ЕСТЬNULL(ПериодыРаботыЗаполненные.Подразделение, ПериодыПозиций.Подразделение) КАК Подразделение,
		|	ЕСТЬNULL(ПериодыРаботыСотрудников.КоличествоСтавок, ВЫБОР
		|		КОГДА ЕСТЬNULL(ПериодыРаботыЗаполненные.Сотрудник, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоСтавок,
		|	ЕСТЬNULL(ПериодыРаботыЗаполненные.Организация, ПериодыПозиций.Организация) КАК Организация,
		|	ПериодыПозиций.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана,
		|	ЕСТЬNULL(ПериодыРаботыЗаполненные.Сотрудник, НЕОПРЕДЕЛЕНО) КАК СотрудникГруппировка
		|ПОМЕСТИТЬ ВТПериодыРаботыСотрудников
		|ИЗ
		|	ВТПериодыПозиций КАК ПериодыПозиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботыЗаполненные КАК ПериодыРаботыЗаполненные
		|		ПО ПериодыПозиций.Позиция = ПериодыРаботыЗаполненные.Позиция
		|		И ПериодыПозиций.Период = ПериодыРаботыЗаполненные.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботыСотрудниковПредварительно КАК ПериодыРаботыСотрудников
		|		ПО (ПериодыРаботыЗаполненные.Позиция = ПериодыРаботыСотрудников.Позиция)
		|		И (ПериодыРаботыЗаполненные.Сотрудник = ПериодыРаботыСотрудников.Сотрудник)
		|		И (ПериодыРаботыЗаполненные.Период >= НАЧАЛОПЕРИОДА(ПериодыРаботыСотрудников.ДатаНачала, МЕСЯЦ))
		|		И (ПериодыРаботыЗаполненные.Период <= ПериодыРаботыСотрудников.ДатаОкончания)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	ПериодыРаботыПустышки.Период,
		|	ПериодыРаботыПустышки.Позиция,
		|	ПериодыРаботыПустышки.Подразделение,
		|	ВЫБОР
		|		КОГДА ПериодыРаботыСотрудников.ДатаНачала ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ПериодыРаботыПустышки.Организация,
		|	ПериодыРаботыПустышки.ПозицияКадровогоПлана,
		|	ПериодыРаботыПустышки.Сотрудник
		|ИЗ
		|	ВТПериодыПозиций КАК ПериодыПозиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыРаботыПустышки КАК ПериодыРаботыПустышки
		|		ПО ПериодыПозиций.Позиция = ПериодыРаботыПустышки.Позиция
		|		И ПериодыПозиций.Период = ПериодыРаботыПустышки.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботыСотрудниковПредварительно КАК ПериодыРаботыСотрудников
		|		ПО (ПериодыРаботыПустышки.Позиция = ПериодыРаботыСотрудников.Позиция)
		|		И (ПериодыРаботыПустышки.Сотрудник = ПериодыРаботыСотрудников.Сотрудник)
		|		И (ВЫБОР
		|			КОГДА ПериодыРаботыПустышки.Период < НАЧАЛОПЕРИОДА(ПериодыРаботыСотрудников.ДатаНачала, МЕСЯЦ)
		|				ТОГДА ИСТИНА
		|			КОГДА ПериодыРаботыПустышки.Период > КОНЕЦПЕРИОДА(ПериодыРаботыСотрудников.ДатаОкончания, МЕСЯЦ)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТПозиции", ИмяВТПозиции);
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТШтатноеРасписаниеСКадровымПланом");
	УдалитьВТ.Добавить("ВТПериодыПозиций");
	УдалитьВТ.Добавить("ВТПериодыРаботыСотрудниковПредварительно");
	УдалитьВТ.Добавить("ВТПозицииПустышки");
	УдалитьВТ.Добавить("ВТПозицииПустышкиСгруппированные");
	УдалитьВТ.Добавить("ВТПозицииЗаполненные");
	УдалитьВТ.Добавить("ВТПозицииЗаполненныеСгруппированные");
	УдалитьВТ.Добавить("ВТПериодыРаботыПустышки");
	УдалитьВТ.Добавить("ВТПериодыРаботыЗаполненные");
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

Функция ПодчиненныеПодразделения(Подразделение) Экспорт
	
	Возврат ОрганизационнаяСтруктура.ПодчиненныеПодразделения(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделение));
	
КонецФункции

Функция СвойстваПоказателейСценария(Сценарий, КадровыйПлан = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КадровыйПлан) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КадровыйПлан", КадровыйПлан);
		Запрос.УстановитьПараметр("ПоказательКоличествоСтавок", ПоказательКоличествоСтавок());
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗначенияПоказателей.Показатель,
			|	ЗначенияПоказателей.Показатель.Категория КАК Категория,
			|	ЗначенияПоказателей.Показатель.КраткоеНаименование КАК КраткоеНаименование
			|ИЗ
			|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияПоказателей
			|ГДЕ
			|	ЗначенияПоказателей.КадровыйПлан = &КадровыйПлан
			|	И НЕ ЗначенияПоказателей.Показатель = &ПоказательКоличествоСтавок";
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Возврат СвойстваПоказателейПоВыборкеРезультатаЗапроса(РезультатЗапроса.Выбрать());
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиКадровогоПланирования.Показатель,
		|	ПоказателиКадровогоПланирования.Показатель.Категория КАК Категория,
		|	ПоказателиКадровогоПланирования.Показатель.КраткоеНаименование КАК КраткоеНаименование
		|ИЗ
		|	Справочник.Сценарии.ПоказателиКадровогоПланирования КАК ПоказателиКадровогоПланирования
		|ГДЕ
		|	ПоказателиКадровогоПланирования.Ссылка = &Сценарий";
	
	Возврат СвойстваПоказателейПоВыборкеРезультатаЗапроса(Запрос.Выполнить().Выбрать());
	
КонецФункции

Функция СвойстваПоказателейПоВыборкеРезультатаЗапроса(Выборка, КадровыйПлан = Неопределено) Экспорт
	
	СвойстваПоказателей = Новый Соответствие;
	УникальныеИменаПоказателей = Новый Массив;
	
	Если КадровыйПлан = Неопределено Тогда
		Пока Выборка.Следующий() Цикл
			ЗаполнитьСвойстваПоказателя(Выборка, УникальныеИменаПоказателей, СвойстваПоказателей);
		КонецЦикла;
	Иначе
		Пока Выборка.НайтиСледующий(КадровыйПлан, "КадровыйПлан") Цикл
			ЗаполнитьСвойстваПоказателя(Выборка, УникальныеИменаПоказателей, СвойстваПоказателей);
		КонецЦикла;
	КонецЕсли;
	
	СвойстваПоказателей.Вставить("УникальныеИменаПоказателей", Новый ФиксированныйМассив(УникальныеИменаПоказателей));
	Возврат СвойстваПоказателей;
	
КонецФункции

Процедура ЗаполнитьСвойстваПоказателя(Выборка, УникальныеИменаПоказателей, СвойстваПоказателей)
	
	Свойства = Новый Структура("Показатель,Категория,КраткоеНаименование");
	ЗаполнитьЗначенияСвойств(Свойства, Выборка);
	УникальноеИмяПоказателя = УникальноеИмяПоказателя(Выборка.Показатель);
	Свойства.Вставить("УникальноеИмяПоказателя", УникальноеИмяПоказателя);
	СвойстваПоказателей.Вставить(УникальноеИмяПоказателя, Свойства);
	УникальныеИменаПоказателей.Добавить(УникальноеИмяПоказателя);
	
КонецПроцедуры

Функция УникальноеИмяПоказателя(Ссылка) Экспорт
	
	Возврат "Показатель" + СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()), "-", "");
	
КонецФункции

Процедура УстановитьСвязьПозиций(ПозицияШтатногоРасписания, ПозицияКадровогоПлана) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ПозицииШтатногоРасписанияПоКадровомуПлану.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПозицияКадровогоПлана = ПозицияКадровогоПлана;
	МенеджерЗаписи.ПозицияШтатногоРасписания = ПозицияШтатногоРасписания;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
